function n(n, u, c) {
    return u in n ? Object.defineProperty(n, u, {
        value: c,
        enumerable: !0,
        configurable: !0,
        writable: !0
    }) : n[u] = c, n;
}

var u, c, y, e = {
    alert: {
        title: {
            cn: "尊敬的用户",
            uy: "ھۆرمەتلىك ئەزا"
        },
        content: {
            cn: "尚未获取到您的用户信息，较多功能无法体验，请允许获取用户信息",
            uy: "ئەزالىق ئۇچۇرىڭىزنى ئوقۇشقا ئىجازەت بەرسىڭىز تېخىمۇ كۆپ ئىقتىدارلاردىن پايدىلىنالايسىز"
        },
        off: {
            cn: "拒绝",
            uy: "ياق"
        },
        on: {
            cn: "允许",
            uy: "ماقۇل"
        }
    },
    collection: {
        km: {
            cn: "公里",
            uy: "كىلومىتىر"
        },
        new: {
            cn: "准新车",
            uy: "يېڭىغا تەۋە"
        },
        old: {
            cn: "年车",
            uy: "يىلنىڭ"
        },
        chexing: {
            cn: "车型",
            uy: "تىپلىق"
        },
        delete: {
            cn: "删除",
            uy: "ئۈچۈرۈش"
        },
        price: {
            cn: "元",
            uy: "يۈەن"
        }
    },
    dting: {
        title: {
            cn: "暂无公告数据",
            uy: "ۋاقتىنچە ئۇچۇر يوق"
        }
    },
    enter: {
        title: {
            cn: "认证店铺",
            uy: "تەستىقلانغان دۇكان"
        },
        price: {
            cn: "元",
            uy: "يۈەن"
        },
        day: {
            cn: "天",
            uy: "كۈن"
        },
        confirm: {
            cn: "确认支付",
            uy: "پۇل تۆلەش"
        },
        title1: {
            cn: "认证店铺发布车辆信息免费",
            uy: "تەستىقلانغان دۇكان ماشىنا چىقارسا ھەقسىز"
        },
        title2: {
            cn: "认证店铺尊享vip店铺页面",
            uy: "تەستىقلانغان دۇكاننىڭ مەخسۇس دۇكان بېتى بولىدۇ"
        },
        title3: {
            cn: "认证店铺可自定义店铺封面及店铺logo",
            uy: "تەستىقلانغان دۇكان ئۆزىنىڭ ۋىۋىسكا ۋە ماركىسىنى چىقىرالايدۇ"
        }
    },
    fensi: {
        follow: {
            cn: "关注",
            uy: "ئەگىشىش"
        },
        store: {
            cn: "店铺",
            uy: "دۇكان"
        },
        datanull: {
            cn: "暂无查看数据",
            uy: "ھازىرچە ئۇچۇر يوق"
        }
    },
    gujia: {
        address: {
            cn: "卖车地点",
            uy: "ماشىنا سېتىش ئورنى"
        },
        address1: {
            cn: "请输入卖车地点",
            uy: "ماشىنا ساتىدىغان ئورۇننى كىرگۈزۈڭ"
        },
        cartype: {
            cn: "品牌车型",
            uy: "ماركا ۋە تىپ"
        },
        cartype1: {
            cn: "请输入品牌车型",
            uy: "ماشىنا ماركىسى ۋە تىپىنى كىرگۈزۈڭ"
        },
        data: {
            cn: "上牌时间",
            uy: "نومۇر تاختىسى ۋاقتى"
        },
        licheng: {
            cn: "请输入行驶里程",
            uy: "باسقان مۇساپىسىنى كىرگۈزۈڭ"
        },
        phone: {
            cn: "电话授权",
            uy: "تېلفۇن نومۇر"
        },
        phone1: {
            cn: "请输入您的电话",
            uy: "تېلفۇن نومۇرىڭزنى كىرگۈزۈڭ"
        },
        price: {
            cn: "估算价格",
            uy: "مۆلچەر باھا"
        }
    },
    home: {
        carMessage: {
            browse: {
                cn: "浏览",
                uy: "كۆرۈش"
            },
            km: {
                cn: "公里",
                uy: "كىلومېتىر"
            },
            new: {
                cn: "全新车",
                uy: "يېڭى ماشىنا"
            },
            old: {
                cn: "车龄",
                uy: "يېشى"
            },
            chexing: {
                cn: "车型",
                uy: "تىپى"
            },
            delete: {
                cn: "删除",
                uy: "ئۆچۈرۈش"
            },
            price: {
                cn: "元",
                uy: "يۈەن"
            },
            baojia: {
                cn: "车主报价",
                uy: "قويغان باھا"
            },
            tostore: {
                cn: "进店逛逛",
                uy: "دۇكانغا كىرىش"
            },
            back: {
                cn: "返回首页",
                uy: "باش بەتكە قايتىش"
            },
            daikuan: {
                cn: "贷款",
                uy: "قەرز"
            },
            zixun: {
                cn: "具体方案请咨询销售顾问",
                uy: "تەپسىلاتىنى دۇكان خادىمىدىن سوراڭ"
            },
            service: {
                cn: "服务保障",
                uy: "مۇلازىمەت كاپالىتى"
            },
            base: {
                cn: "基本信息",
                uy: "ئاساسىي ئۇچۇر"
            },
            gearbox: {
                cn: "变速箱",
                uy: "كورۇپكا"
            },
            gearbox1: {
                cn: "手自一体",
                uy: "قول ۋە ئاپتوماتىك خوت"
            },
            gearbox2: {
                cn: "手动档",
                uy: "قول خوت"
            },
            gearbox3: {
                cn: "自动挡",
                uy: "ئاپتوماتىك خوت"
            },
            exhaust: {
                cn: "排气量",
                uy: "چىقىرىش مىقدارى"
            },
            caraddress: {
                cn: "看车地点",
                uy: "ماشىنا كۆرۈش ئورنى"
            },
            fastaddress: {
                cn: "快速导航",
                uy: "تىز يول باشلاش"
            },
            introduce: {
                cn: "车辆介绍",
                uy: "ماشىنا تونۇشتۇرۇش"
            },
            guss: {
                cn: "猜你喜欢",
                uy: "سىزنىڭ ياقتۇرىشىڭىز"
            },
            recommend: {
                cn: "推荐",
                uy: "تەۋسىيە"
            },
            tag1: {
                cn: "认证车商",
                uy: "تەستىقلانغان سودىگەر"
            },
            tag2: {
                cn: "自营",
                uy: "شەخسى"
            }
        },
        index: {
            recommend: {
                cn: "推荐",
                uy: "تەۋسىيە"
            },
            tag1: {
                cn: "认证车商",
                uy: "تەستىقلانغان سودىگەر"
            },
            tag2: {
                cn: "自营",
                uy: "شەخسى"
            },
            km: {
                cn: "公里",
                uy: "كىلومىتىر"
            },
            new: {
                cn: "全新车",
                uy: "يېڭى ماشىنا"
            },
            old: {
                cn: "车龄",
                uy: "يېشى"
            },
            chexing: {
                cn: "车型",
                uy: "تىپى"
            },
            price: {
                cn: "元",
                uy: "يۈەن"
            }
        },
        jubao: {
            title: {
                cn: "请选择举报的理由",
                uy: "پاش قىلىش سەۋەبىنى سەۋەبنى تاللاڭ"
            },
            detail: {
                cn: "本平台会坚决落实非法、虚假、色情等信息，你的举报我们会认真查实并根据平台协议进行落实！",
                uy: "بۇ سۇپا ساختا، قانۇنسىز ۋە شەھۋانى ئۇچۇرلارغا قەتئىي قارشى تۇرىدۇ، پاش قىلسىڭز سۇپىدىن تازىلايمىز"
            },
            cardetail: {
                cn: "车辆信息",
                uy: "ماشىنا ئۇچۇرى"
            },
            liuyan: {
                cn: "留言内容",
                uy: "خەت قالدۇرۇش مەزمۇنى"
            },
            jubao: {
                cn: "举报理由",
                uy: "پاش قىلىش سەۋەبى"
            },
            commit: {
                cn: "提交",
                uy: "تاپشۇرۇش"
            },
            niming: {
                cn: "匿名留言",
                uy: "نامسىز خەت قالدۇرۇش"
            },
            more: {
                cn: "查看更多",
                uy: "تېخىمۇ كۆپ"
            },
            storeliuyan: {
                cn: "商家留言",
                uy: "خەت قالدۇرۇش"
            },
            min: {
                cn: "不少于20字",
                uy: "ئاز بولغاندا 20 ھەرپ"
            }
        },
        liuyan: {
            time: {
                cn: "时间",
                uy: "ۋاقىت"
            },
            nickname: {
                cn: "昵称",
                uy: "نامى"
            },
            open: {
                cn: "展开",
                uy: "ئېچىش"
            },
            close: {
                cn: "收起",
                uy: "يىغىش"
            }
        },
        poster: {
            view: {
                cn: "立即查看",
                uy: "كۆرۈش"
            },
            build: {
                cn: "正在生成海报",
                uy: "تەشۋىقات رەسىمىڭىز ياسىلىۋاتىدۇ"
            },
            save: {
                cn: "保存推广图片",
                uy: "تەشۋىق رەسىمىنى ساقلاش"
            }
        },
        searchShop: {
            searchtitle: {
                cn: "请输入关键字进行搜索",
                uy: "ھالقىلىق سۆزنى كىرگۈزۈپ ئىزدەڭ"
            },
            search: {
                cn: "搜索",
                uy: "ئىزدەش"
            },
            cancel: {
                cn: "取消",
                uy: "بىكار قىلىش"
            },
            store: {
                cn: "店铺",
                uy: "دۇكان"
            },
            history: {
                cn: "历史搜索",
                uy: "ئىزدەش خاتىرىسى"
            },
            delete: {
                cn: "删除",
                uy: "ئۆچۈرۈش"
            }
        }
    },
    index: (u = {
        searchtitle: {
            cn: "请输入搜索内容",
            uy: "ئىزدىمەكچى بولغان مەزمۇننى كىرگۈزۈڭ"
        },
        detail: {
            cn: "详情",
            uy: "تەپسىلاتى"
        },
        recommendstore: {
            cn: "推荐门店",
            uy: "تەۋسىيەلىك دۇكان"
        },
        platform: {
            cn: "平台推荐",
            uy: "سۇپا تەۋىسىيەسى"
        },
        sort: {
            cn: "排序",
            uy: "تەرتىپ"
        },
        brand: {
            cn: "品牌",
            uy: "ماركا"
        },
        old: {
            cn: "年限",
            uy: "يىل چېكى"
        },
        class: {
            cn: "分类",
            uy: "تۈرى"
        },
        price: {
            cn: "价格",
            uy: "باھاسى"
        }
    }, n(u, "old", {
        cn: "浏览",
        uy: "كۆرۈش"
    }), n(u, "km", {
        cn: "公里",
        uy: "كىلومىتىر"
    }), n(u, "new", {
        cn: "全新车",
        uy: "يېڭى ماشىنا"
    }), n(u, "old", {
        cn: "车龄",
        uy: "يېشى"
    }), n(u, "chexing", {
        cn: "车型",
        uy: "تىپى"
    }), n(u, "price", {
        cn: "元",
        uy: "يۈەن"
    }), n(u, "gearbox", {
        cn: "变速箱",
        uy: "كوروپكا"
    }), n(u, "gearbox1", {
        cn: "手自一体",
        uy: "قول ۋە ئاپتوماتىك خوت"
    }), n(u, "gearbox2", {
        cn: "手动档",
        uy: "قول خوت"
    }), n(u, "gearbox3", {
        cn: "自动挡",
        uy: "ئاپتوماتىك خوت"
    }), n(u, "recommend", {
        cn: "推荐",
        uy: "تەۋسىيە"
    }), n(u, "tag1", {
        cn: "认证车商",
        uy: "تەستىقلانغان سودىگەر"
    }), n(u, "tag2", {
        cn: "自营",
        uy: "شەخسى"
    }), n(u, "datanull", {
        cn: "没有更多了",
        uy: "ئۇچۇر تۈگىدى"
    }), u),
    loan: {
        phone: {
            cn: "联系电话",
            uy: "ئالاقە نومۇر"
        },
        auth: {
            cn: "电话授权",
            uy: "ھوقۇقلۇق تېلفۇن"
        },
        commit: {
            cn: "提交",
            uy: "تاپشۇرۇش"
        },
        remark: {
            cn: "提交后销售顾问会与您联系",
            uy: "يوللانغاندىن كېيىن مەسئۇل خادىم سىز بىلەن ئالاقىلىشىدۇ"
        }
    },
    mine: (c = {
        fensi: {
            time: {
                cn: "推广时间",
                uy: "تەشۋىقات ۋاقتى"
            },
            store: {
                cn: "店铺",
                uy: "دۇكان"
            },
            datanull: {
                cn: "暂无查看数据",
                uy: "ۋاقتىنچە ئۇچۇر يوق"
            }
        },
        info: {
            storename: {
                cn: "店铺名称",
                uy: "دۇكان ئىسمى"
            },
            inputstore: {
                cn: "请输入店铺名称",
                uy: "دۇكان ئىسىمنى كىرگۈزۈڭ"
            },
            phone: {
                cn: "咨询电话",
                uy: "مەسلىھەت تېلېفونى "
            },
            phone1: {
                cn: "电话授权",
                uy: "ھوقۇقلۇق تېلفۇن"
            },
            inputphone: {
                cn: "请输入咨询电话",
                uy: "تېلفۇن نومۇرنى كىرگۈزۈڭ"
            },
            address: {
                cn: "看车地址",
                uy: "ماشىنا كۆرۈش ئورنى"
            },
            getaddress: {
                cn: "获取位置",
                uy: "ئورۇن بەلگىلەش"
            },
            store: {
                cn: "店铺",
                uy: "دۇكان"
            },
            edit: {
                cn: "编辑",
                uy: "تەھرىرلەش"
            },
            home: {
                cn: "店铺封面",
                uy: "دۇكان مۇقاۋىسى"
            },
            edithome: {
                cn: "编辑封面",
                uy: "مۇقاۋا تەھرىرلەش"
            },
            save: {
                cn: "保存",
                uy: "ساقلاش"
            }
        },
        publicity: {
            build: {
                cn: "立即生成",
                uy: "كود رەسىم چىقىرىش"
            },
            save: {
                cn: "保存推广图片",
                uy: "رەسىمنى ساقلاش"
            }
        },
        sale: {
            tixian: {
                cn: "提现",
                uy: "نەقلەشتۈرۈش"
            },
            acount: {
                cn: "总佣金",
                uy: "ئۇمۇمى كىرىم"
            },
            yitixian: {
                cn: "已提现",
                uy: "نەقلەشكىنى"
            },
            ketixian: {
                cn: "可提现",
                uy: "نەقلىشىدىغىنى"
            },
            number: {
                cn: "推广人数",
                uy: "ئەزا سانى"
            },
            yongjinlogs: {
                cn: "佣金记录",
                uy: "كىرىم خاتىرىسى"
            },
            tuiguanglogs: {
                cn: "推广记录",
                uy: "ئەزا تىزىملىكى"
            },
            tixiandetail: {
                cn: "提现明细",
                uy: "نەقلەشتۈرۈش تەپسىلاتى"
            },
            tuiguangcode: {
                cn: "我的推广码",
                uy: "تەشۋىقات كود رەسىمىم"
            }
        },
        tixian: {
            title: {
                cn: "提现金额",
                uy: "نەقلەشتۈرۈش سوممىسى"
            },
            tixianmoney: {
                cn: "可提现金额",
                uy: "نەقلەشتۈرگىلى بولدىغان سومما"
            },
            submit: {
                cn: "申请提现",
                uy: "نەقلەشتۈرۈشنى ئىلتىماس قىلىش"
            }
        },
        tixianjilu: {
            yuan: {
                cn: "元",
                uy: "يۈەن"
            },
            jujue: {
                cn: "已拒绝",
                uy: "رەت قىلىنغان"
            },
            tixian: {
                cn: "已提现",
                uy: "نەقلەشكەن"
            },
            shenhe: {
                cn: "审核中",
                uy: "تەستىقلىنىۋاتىدۇ"
            },
            datanull: {
                cn: "暂无查看数据",
                uy: "ۋاقتىنچە ئۇچۇر يوق"
            }
        },
        yongjinjilu: {
            account: {
                cn: "总计消费",
                uy: "جەمئىي سودا"
            },
            totalbrokerage: {
                cn: "产生佣金",
                uy: "يارالغان كىرىم"
            },
            xiaofei: {
                cn: "消费",
                uy: "سودا"
            },
            brokerage: {
                cn: "佣金",
                uy: "كىرىم"
            },
            datanull: {
                cn: "暂无查看数据",
                uy: "ۋاقتىنچە ئۇچۇر يوق"
            }
        },
        renzheng: {
            cn: "去入驻",
            uy: "دۇكان ئېچىش"
        },
        shoucang: {
            cn: "收藏",
            uy: "ساقلاش"
        },
        guanzhu: {
            cn: "关注",
            uy: "ئەگىشىش"
        },
        fabu: {
            cn: "发布",
            uy: "چىقىرىش"
        }
    }, n(c, "fensi", {
        cn: "粉丝",
        uy: "مەستانە"
    }), n(c, "rstore", {
        cn: "认证店铺",
        uy: "تەستىقلانغان دۇكان"
    }), n(c, "mybuild", {
        cn: "我的发布",
        uy: "مىنىڭ چىقارغانلىرىم"
    }), n(c, "storeview", {
        cn: "店铺预览",
        uy: "دۇكان كۆرۈش"
    }), n(c, "myshoucang", {
        cn: "我的收藏",
        uy: "ساقلىغانلىرىم"
    }), n(c, "myguanzhu", {
        cn: "我的关注",
        uy: "ئەگەشكەنلىرىم"
    }), n(c, "guanzhumy", {
        cn: "关注我的",
        uy: "ئەگەشكۈچىلىرىم"
    }), n(c, "tuiguang", {
        cn: "推广中心",
        uy: "تەشۋىقات مەركىزى"
    }), n(c, "myqrcore", {
        cn: "我的店铺码",
        uy: "دۇكان كود رەسىمىم"
    }), n(c, "viewliuyan", {
        cn: "查看留言",
        uy: "قالدۇرۇلغان خەتنى كۆرۈش"
    }), n(c, "help", {
        cn: "客服帮助",
        uy: "مۇلازىمەتچى ياردىمى"
    }), c),
    publicity: {
        build: {
            cn: "立即生成",
            uy: "كود رەسىم چىقىرىش"
        },
        save: {
            cn: "保存推广图片",
            uy: "رەسىمنى ساقلاش"
        }
    },
    sale: {
        cardetail: {
            cn: "车辆详图",
            uy: "رەسىم"
        },
        classes: {
            cn: "车辆类型",
            uy: "تۈرى"
        },
        brand: {
            cn: "车辆品牌",
            uy: "ماركىسى"
        },
        carname: {
            cn: "汽车名称",
            uy: "ئىسمى"
        },
        carname1: {
            cn: "请输入汽车名称",
            uy: "ماشىنا ئىسمىنى كىرگۈزۈڭ"
        },
        date: {
            cn: "上牌日期",
            uy: "نومۇر تاختا ۋاقتى"
        },
        licheng1: {
            cn: "请输入行驶里程",
            uy: "باسقان مۇساپىسىنى كىرگۈزۈڭ"
        },
        licheng: {
            cn: "行驶里程(KM)",
            uy: "باسقان مۇساپىسى"
        },
        saleprice: {
            cn: " 售价(元)",
            uy: "باھاسى"
        },
        saleprice1: {
            cn: " 请输入转让价格：",
            uy: "سېتىش باھاسىنى كىرگۈزۈڭ"
        },
        exhaust: {
            cn: "排气量",
            uy: "چىقرىش مىقدارى"
        },
        exhaust1: {
            cn: "请输入排气量（如：1.6）T",
            uy: "مەسىلەن 1.6 ؛ 2.0 دىگەندەك"
        },
        gearbox: {
            cn: "变速箱",
            uy: "كوروپكا"
        },
        phone: {
            cn: "电话授权",
            uy: "ھوقۇقلۇق تېلفۇن"
        },
        phone1: {
            cn: "请输入您的电话",
            uy: "تېلفۇن نومۇرىڭزنى كىرگۈزۈڭ"
        },
        address: {
            cn: "车辆地址",
            uy: "ماشىنا ئادرىسى"
        },
        address1: {
            cn: "获取位置",
            uy: "ئورۇن بەلگىلەش"
        },
        warming: {
            cn: "已经禁止发布车辆信息",
            uy: "ماشىنا ئۇچۇرى چىقىرىش چەكلەندى"
        },
        warming1: {
            cn: "发布不真实车源，虚报价格，一经核查将做封号处理。",
            uy: "يالغان، ساختا ماشىنا ئۇچۇرى ۋە باھا چىقارسىڭىز نومۇرىڭىز ئىتىۋېتىلىدۇ"
        },
        save: {
            cn: "发布",
            uy: "ئېلان قىلىش"
        }
    },
    saleindex: {
        saletap: {
            cn: "立即卖车",
            uy: "ماشىنا سېتىش"
        },
        zixun: {
            cn: "免费咨询",
            uy: "ھەقسىز مەسلىھەت سوراش"
        },
        fujia: {
            cn: "爱车估价",
            uy: "ماشىنا باھالىتىش"
        }
    },
    salelist: {
        km: {
            cn: "公里",
            uy: "كىلومىتىر"
        },
        new: {
            cn: "全新车",
            uy: "يېڭى ماشىنا"
        },
        old: {
            cn: "年车",
            uy: "يىلى"
        },
        status1: {
            cn: "已上架",
            uy: "چىقىرىلغىنى"
        },
        status2: {
            cn: "未上架",
            uy: "چىقىرىلمىغىنى"
        },
        status3: {
            cn: "上架",
            uy: "چىقىرىلدى"
        },
        status4: {
            cn: "上架",
            uy: "چىقىرىلدى"
        },
        edit: {
            cn: "编辑",
            uy: "ئۆزگەرتىش"
        },
        delete: {
            cn: "删除",
            uy: "ئۆچۈرۈش"
        },
        upthiscar: {
            cn: "置顶",
            uy: "چوققىلاش"
        },
        datanull: {
            cn: "暂无查看数据",
            uy: "ۋاقتىنچە ئۇچۇر يوق"
        }
    },
    store: (y = {
        browse: {
            cn: "人气",
            uy: "كۆرگەن ئادەم"
        },
        release: {
            cn: "发布",
            uy: "ئېلان قىلىش"
        },
        fans: {
            cn: "粉丝",
            uy: "مەستانە"
        },
        km: {
            cn: "公里",
            uy: "كىلومىتىر"
        },
        newup: {
            cn: "最新上架",
            uy: "ئەڭ يېڭى چىققىنى"
        }
    }, n(y, "newup", {
        cn: "最新上架",
        uy: "ئەڭ يېڭى چىققىنى"
    }), n(y, "more", {
        cn: "查看更多",
        uy: "تېخىمۇ كۆپ"
    }), n(y, "nomore", {
        cn: "没有更多了",
        uy: "ئۇچۇر تۈگىدى"
    }), n(y, "oldview", {
        cn: "往日推荐",
        uy: "ئىلگىرىكى تەۋسىيە "
    }), n(y, "new", {
        cn: "全新车",
        uy: "يېڭى ماشىنا"
    }), n(y, "old", {
        cn: "车龄",
        uy: "يېشى"
    }), n(y, "price", {
        cn: "元",
        uy: "يۈەن"
    }), n(y, "service", {
        cn: "服务保障",
        uy: "مۇلازىمەت كاپالەت"
    }), n(y, "gearbox1", {
        cn: "手自一体",
        uy: "قول ۋە ئاپتوماتىك خوت"
    }), n(y, "gearbox2", {
        cn: "手动档",
        uy: "قول خوت"
    }), n(y, "gearbox3", {
        cn: "自动挡",
        uy: "ئاپتوماتىك خوت"
    }), n(y, "recommend", {
        cn: "推荐",
        uy: "تەۋسىيە"
    }), n(y, "tag1", {
        cn: "认证车商",
        uy: "تەستىقلانغان سودىگەر"
    }), n(y, "tag2", {
        cn: "自营",
        uy: "شەخسى"
    }), y)
};

module.exports = e;